<a href="https://colab.research.google.com/github/koolganni/pandas-cheatsheet/blob/main/pandas-cheatsheet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

**1. How to change values in a pandas DataFrame column based on a condition in Python**

In [2]:
df = pd.DataFrame(data={'Name': ['Bob', 'Paul'], 'Age': [22, 24]})

In [3]:
df

   Name  Age
0   Bob   22
1  Paul   24

In [4]:
# pandas.DataFrame.loc[condition, column_label] = new_value
df.loc[df.Name == 'Bob', 'Age'] = 26
df

   Name  Age
0   Bob   26
1  Paul   24